{
    "qed": "QED (Quantitative Estimate of Drug-likeness) is a measure that quantifieshow 'drug-like' a molecule is based on properties such as molecular weight,solubility, and the number of hydrogen bond donors and acceptors.Adding functional groups that improve drug-like properties (e.g., small molecular size,balanced hydrophilicity) can increase QED, while introducing large, complex, or highly polar groups can decrease it.",
    "logp": "LogP is the logarithm of the partition coefficient, measuring the lipophilicityor hydrophobicity of a molecule, indicating its solubility in fats versus water.Adding hydrophobic groups (e.g., alkyl chains or aromatic rings) increases LogP,while adding polar or hydrophilic groups (e.g., hydroxyl or carboxyl groups) decreases it.",
    "donor": "Donor Number refers to the number of hydrogen bond donors (atoms like NH or OH) in a molecule,influencing its interaction with biological targets.Introducing additional hydrogen bond donors (e.g., hydroxyl or amine groups) increasesthe Donor Number, while removing or modifying these groups decreases it.",
    "similarity": "Similarity in this context is calculated using Morgan fingerprints, which represent molecularstructures, and Tanimoto similarity measures how structurally similar two molecules are based on their fingerprints.Modifying the core structure of a molecule significantly (e.g., ring opening or closing) decreases similarity,while smaller changes like side-chain substitutions tend to have a lesser impact on similarity.",
    "logs": "Log S indicates the solubility of a molecule in water, with higher values showing better solubility. Adding polar functional groups (like -OH or -COOH) can increase Log S, while adding hydrophobic groups (like long alkyl chains) can decrease it.",
    "reduction_potential": "Reduction potential quantifies a molecule's tendency to gain electrons and undergo reduction. Introducing electron-withdrawing groups (like -NO2) can increase reduction potential, while adding electron-donating groups (like -OH or -CH3) can decrease it.",
    "sa": "SA measures how easily a molecule can be synthesized based on its structural complexity. Simplifying a molecule by reducing complex ring systems or functional groups can lower SA, making synthesis easier, while adding complex structures can increase SA, making synthesis harder.",
    "drd2": "Dopamine receptor D2 (DRD2) is a receptor involved in the modulation of neurotransmission and is a target for various psychiatric and neurological disorders. Adding functional groups like hydroxyl or halogen atoms to aromatic rings can enhance binding affinity to DRD2. Removing aromaticity or introducing bulky groups near the binding sites often decreases DRD2 activity.",
    "gsk3b": "Glycogen synthase kinase-3 beta (GSK3β) is an enzyme involved in cellular processes like metabolism and apoptosis, and is a therapeutic target for cancer and neurological diseases.Adding polar groups, such as hydroxyls, can improve hydrogen bonding with GSK3β's active site.Introducing steric hindrance or highly hydrophobic regions can reduce interactions with GSK3β.",
    "jnk3": "c-Jun N-terminal kinase 3 (JNK3) is a kinase involved in stress signaling and is targeted for neuroprotection in diseases like Alzheimer's.Introducing small polar or electronegative groups can enhance binding affinity to JNK3.Removing polar functional groups or adding large, bulky substituents can reduce activity by obstructing the active site.",
    "bbbp": "The BBBP (Blood-Brain Barrier Permeability) is a measure of how well a molecule can cross the blood-brain barrierIncreasing the hydrophobicity, optimizing molecular size, and modifying functional groups to enhance lipophilicity can increase BBBP.Introducing polar or charged groups, increasing molecular size, and adding hydrogen-bond donors can decrease BBBP.",
    "smarts_filter": "To pass the SMARTS filter, the proposed molecule must not have the following substructures:reactive alkyl halides: [Br,Cl,I][CX4;CH,CH2]acid halides: [S,C](=[O,S])[F,Br,Cl,I]carbazides: O=CN=[N+]=[N-]sulphate esters: COS(=O)O[C,c]sulphonates: COS(=O)(=O)[C,c]acid anhydrides: C(=O)OC(=O)peroxides: OOpentafluorophenyl esters: C(=O)Oc1c(F)c(F)c(F)c(F)c1(F)esters of HOBT: C(=O)Onnnisocyanates & isothiocyanates: N=C=[S,O]triflates: OS(=O)(=O)C(F)(F)Flawesson's reagent and derivatives: P(=S)(S)Sphosphoramides: NP(=O)(N)Naromatic azides: cN=[N+]=[N-]acylhydrazide: [N;R0][N;R0]C(=O)quaternary C, Cl, I, P or S: [C+,Cl+,I+,P+,S+]phosphoranes: C=Pchloramidines: [Cl]C([C&R0])=Nnitroso: [N&D2](=O)P/S Halides: [P,S][Cl,Br,F,I]carbodiimide: N=C=Nisonitrile: [N+]#[C-]triacyloximes: C(=O)N(C(=O))OC(=O)cyanohydrins: N#CC[OH]acyl cyanides: N#CC(=O)sulfonyl cyanides: S(=O)(=O)C#Ncyanophosphonates: P(OCC)(OCC)(=O)C#Nazocyanamides: [N;R0]=[N;R0]C#Nazoalkanals: [N;R0]=[N;R0]CC=Oepoxides, thioepoxides, aziridines: C1[O,S,N]C1esters, thioesters: C[O,S;R0][C;R0](=[O,S])cyanamides: NC#Nfour membered lactones: C1(=O)OCC1betalactams: N1CCC1=Odi and triphosphates: P(=O)([OH])OP(=O)[OH]acyclic C=C-O: C=[C!r]Oamidotetrazole: c1nnnn1C=Oazo group: N#Nhydroxamic acid: C(=O)N[OH]imine: C=[N!R]imine: N=[CR0][N,n,O,S]ketene: C=C=Onitro group: [N+](=O)[O-]N-nitroso: [#7]-N=Ooxime: [C,c]=N[OH]oxime: [C,c]=NOC=OOxygen-nitrogen single bond: [OR0,NR0][OR0,NR0]perfluorinated chain: [CX4](F)(F)[CX4](F)F",
    "celecoxib_rediscovery": "celecoxib_rediscovery evaluates whether the model can generate Celecoxib, a COX-2 inhibitor, indicating the capacity to rediscover a known, structurally complex drug. Adding sulfonamide or diaryl heterocycle structures can increase similarity. Replacing the sulfonamide or altering ring systems significantly will reduce similarity.",
    "troglitazone_rediscovery": "troglitazone_rediscovery measures the ability of a model to regenerate the structure of Troglitazone, a withdrawn anti-diabetic drug, from scratch. This tests scaffold memorization and reproduction capabilities. Including thiazolidinedione or chromane-like scaffolds helps increase similarity. Removing or heavily altering the thiazolidinedione ring lowers similarity.",
    "thiothixene_rediscovery": "thiothixene_rediscovery assesses the model's ability to regenerate Thiothixene, an antipsychotic, which challenges models to recover less common or complex molecules. Preserving the tricyclic core and adding a piperazine ring increases similarity. Breaking the tricyclic core or replacing the piperazine diminishes similarity.",
    "albuterol_similarity": "albuterol_similarity encourages generation of molecules structurally and chemically similar to Albuterol, a β2-agonist used in asthma, measuring chemical similarity. Adding a hydroxyphenethylamine backbone and β-hydroxy groups increases similarity. Replacing the phenyl ring or removing hydroxyl groups decreases similarity.",
    "mestranol_similarity": "mestranol_similarity targets molecules similar to Mestranol, a synthetic estrogen, highlighting the model's capacity to capture nuanced structural features. Preserving the steroid nucleus and ether at C3 increases similarity. Opening the steroid ring system or removing the C3 ether reduces similarity.",
    "isomers_c7h8n2o2": " isomers_c7h8n2o2 Asks the model to generate all valid isomers of the molecular formula c7h8n2o2, testing chemical enumeration and diversity.. Increasing this objective involves rearranging bonds and functional groups while maintaining the same atom count and valency. Adding or removing atoms, or creating tautomers outside the formula, decreases performance on this objective.",
    "isomers_c9h10n2o2pf2cl":"isomers_c9h10n2o2pf2cl  focuses on generating isomers of a more complex molecule with the formula c9h10n2o2pf2cl. To improve the objective, modifications must explore valid bond arrangements and stereoisomers within strict atomic constraints. Introducing or deleting atoms or violating bonding rules lowers the score.",
    "median1": "median1 is a benchmark combines five rediscovery tasks (troglitazone, thiothixene, albuterol_similarity, mestranol_similarity, and isomers_c7h8n2o2) and reports the median performance across them. The objective is to assess general capability in molecule rediscovery and similarity matching. Each task involves optimizing for high structural similarity (usually Tanimoto similarity) to the target compound while maintaining chemical validity and diversity. No single objective is explicitly defined; rather, the test implicitly requires balance across structure generation, memorization, and diversity.",
    "median2": "A harder version of median1, this benchmark includes more complex tasks such as fexofenadine_mpo, scaffold_hop, and zaleplon_mpo. These involve multiple competing properties like drug-likeness, synthetic accessibility, and scaffold innovation. The goal is to evaluate model robustness across varied, real-world challenges, combining rediscovery, optimization, and scaffold-level creativity.",
    "osimertinib_mpo": "osimertinib_mpo measures a molecule's performance based on multi-parameter optimization (MPO) relative to osimertinib, an EGFR inhibitor. Improving it requires balancing properties like potency, lipophilicity, molecular weight, and synthetic accessibility similar to osimertinib. Overly modifying physicochemical properties, such as adding too many polar groups or large rings, will reduce the objective score.",
    "fexofenadine_mpo": "fexofenadine_mpo This multi-parameter optimization task is based on Fexofenadine, an antihistamine. The objectives include: QED, logP, TPSA, SA, The model must find compounds balancing all these properties, not just maximize one.",
    "ranolazine_mpo": "ranolazine_mpo assesses how well a molecule matches the drug-like profile of ranolazine, an antianginal agent. Keeping moderate size and balancing aromatic and polar groups helps improve it. Adding bulky or highly hydrophobic groups tends to lower the score.",
    "perindopril_mpo": "perindopril_mpo evaluates similarity to perindopril, an ACE inhibitor, based on multiple drug-like properties. Including polar side chains and maintaining flexibility aids the objective. Adding rigid rings or highly lipophilic features lowers the score.",
    "amlodipine_mpo": "amlodipine_mpo Modeled after Amlodipine, a calcium channel blocker, this task focuses on: QED,logP,HBA/HBD,SA,The goal is to produce compounds that remain realistic drug candidates while structurally diverging from Amlodipine.",
    "sitagliptin_mpo": "sitagliptin_mpo Inspired by Sitagliptin, a diabetes medication, this task involves optimizing: QED, logP, TPSA, Number of Rotatable Bonds, SA The challenge is to generate potent molecules with realistic pharmacokinetic profiles and limited synthetic complexity.",
    "zaleplon_mpo": "zaleplon_mpo Based on Zaleplon, a sedative-hypnotic, this task combines: QED, logP, TPSA, SA, Toxicophore avoidance: Molecules containing certain known toxic substructures are penalized. This simulates a real-world scenario where the model must generate safe, effective, and synthesizable analogs.",
    "valsartan_smarts": "valsartan_smarts his task is centered on the antihypertensive drug Valsartan. The objective is to: Generate molecules containing specific substructures defined by SMARTS patterns derived from Valsartan. Optimize for QED to maintain drug-likeness. Satisfy logP and SA thresholds. This tests the model's ability to preserve key pharmacophores while innovating around them to generate viable analogs.",
    "deco_hop": "deco_hop Scaffold decoration hopping: encourages the generation of molecules with the same core scaffold as the reference but new decorations (side chains). Replacing peripheral groups while keeping the scaffold intact supports this objective. Altering or breaking the core scaffold drastically will reduce the score.",
    "scaffold_hop": "scaffold_hop Requires replacing the scaffold of a known active molecule while preserving key pharmacophoric features, testing innovation with constraint retention. Replacing the core with a novel but functionally similar scaffold improves the score. Retaining the same scaffold or losing essential pharmacophoric features lowers the score."
}